src/cf/src/Documents/РаботыПоЗадаче/РаботыПоЗадаче.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаботыПоЗадаче</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСОрганизациями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>DefinedType.ТрудоемкостьЧасовНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеДобавление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчетыСОрганизациями/ВзаиморасчетыСОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСОрганизациями</name>
  <resources>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <comment>АПК:1208 Считаем корректным имя в Купорос</comment>
    <type>
      <types>TaskRef.ЗадачиПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьДиректора</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьГлавногоБухгалтера</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОрганизации</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/РаботыПоЗадаче/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Зафиксировать работу по задаче
//
// Параметры:
//  ДанныеЗаполнения - Структура - содержит свойства:
//		* Дата
//		* Задача
//		* Исполнитель
//		* ФактическаяТрудоемкость
//		* РучноеДобавление - Булево - (необязательное)
//		* РаботаПоЗадаче - ДокументСсылка.РаботыПоЗадаче - (необязательное)
//
Процедура ЗафиксироватьРаботуПоЗадаче(ДанныеЗаполнения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Проверяем наличие ранее остатков по исполнителю и учитываем в расчете
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСОрганизациямиОстатки.Задача КАК Задача,
	               |	ВзаиморасчетыСОрганизациямиОстатки.ФактическаяТрудоемкостьОстаток КАК ОстатокПоИсполнителю
	               |ПОМЕСТИТЬ ОстаткиПоФактическимТрудозатратамИсполнителя
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСОрганизациями.Остатки(
	               |			&ДатаСреза,
	               |			Задача = &Задача
	               |				И Исполнитель = &Исполнитель) КАК ВзаиморасчетыСОрганизациямиОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РаботыПоЗадаче.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ОстаткиПоФактическимТрудозатратамИсполнителя.ОстатокПоИсполнителю, 0) КАК ОстатокПоИсполнителю
	               |ИЗ
	               |	Документ.РаботыПоЗадаче КАК РаботыПоЗадаче
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоФактическимТрудозатратамИсполнителя КАК ОстаткиПоФактическимТрудозатратамИсполнителя
	               |		ПО РаботыПоЗадаче.Задача = ОстаткиПоФактическимТрудозатратамИсполнителя.Задача
	               |ГДЕ
	               |	РаботыПоЗадаче.Задача = &Задача
	               |	И РаботыПоЗадаче.Исполнитель = &Исполнитель
	               |	И НЕ РаботыПоЗадаче.ПометкаУдаления
	               |	И НЕ РаботыПоЗадаче.РучноеДобавление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиПоФактическимТрудозатратамИсполнителя.ОстатокПоИсполнителю КАК ОстатокПоИсполнителю
	               |ИЗ
	               |	ОстаткиПоФактическимТрудозатратамИсполнителя КАК ОстаткиПоФактическимТрудозатратамИсполнителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗадачиПользователя.Ссылка КАК Ссылка,
	               |	ЗадачиПользователя.Проект КАК Проект,
	               |	ЗадачиПользователя.Проект.Организация КАК Организация
	               |ИЗ
	               |	Задача.ЗадачиПользователя КАК ЗадачиПользователя
	               |ГДЕ
	               |	ЗадачиПользователя.Ссылка = &Задача
	               |	И ЗадачиПользователя.Проект.Организация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Задача", ДанныеЗаполнения.Задача);
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеЗаполнения.Дата - 1);
	Запрос.УстановитьПараметр("Исполнитель", ДанныеЗаполнения.Исполнитель);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	ВыборкаОстатков = Результат[2].Выбрать();
	ВыборкаРеквизитовЗадачи =  Результат[3].Выбрать();
	
	РаботаПоЗадаче = ?(ДанныеЗаполнения.Свойство("РаботаПоЗадаче"), ДанныеЗаполнения.РаботаПоЗадаче, Документы.РаботыПоЗадаче.ПустаяСсылка());
	РучноеДобавление = ?(ДанныеЗаполнения.Свойство("РучноеДобавление"), ДанныеЗаполнения.РучноеДобавление, Ложь);
	
	Если Выборка.Следующий() Тогда
	
		ОбъектДокумент = Выборка.Ссылка.ПолучитьОбъект();
		
		ДобавляемыйОстатокПоЗатратам = ДанныеЗаполнения.ФактическаяТрудоемкость - Выборка.ОстатокПоИсполнителю;
		
	ИначеЕсли ЗначениеЗаполнено(РаботаПоЗадаче) Тогда	
		// при фиксации из формы затраченного времени
		
		ОбъектДокумент = РаботаПоЗадаче.ПолучитьОбъект();
		
		ДобавляемыйОстатокПоЗатратам = ДанныеЗаполнения.ФактическаяТрудоемкость;
		
	Иначе
		
		ОбъектДокумент = Документы.РаботыПоЗадаче.СоздатьДокумент();
		
		Если ВыборкаОстатков.Следующий()
			И Не РучноеДобавление Тогда
			// ранее найденный остаток отнимается от фактической полной
			ДобавляемыйОстатокПоЗатратам = ДанныеЗаполнения.ФактическаяТрудоемкость - ВыборкаОстатков.ОстатокПоИсполнителю;
			
		Иначе
			
			ДобавляемыйОстатокПоЗатратам = ДанныеЗаполнения.ФактическаяТрудоемкость;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектДокумент, ДанныеЗаполнения,,"ФактическаяТрудоемкость");
	ВыборкаРеквизитовЗадачи.Следующий();
	ОбъектДокумент.Организация = ВыборкаРеквизитовЗадачи.Организация;	
	ОбъектДокумент.ФактическаяТрудоемкость = ДобавляемыйОстатокПоЗатратам;
	
	ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	ДанныеЗаполнения.Вставить("РаботаПоЗадаче", ОбъектДокумент.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
